Accessing DataFrame using Index and slicing

In [22]:
import pandas as pd
df = pd.read_csv('c:/users/rakesh/desktop/Notes/pandascode/student.csv')
print(df)

     name  english  math  cs  physics  chemistry
0  rakesh       45    87  56       56         78
1    amit       56    89  56       67         87
2      jm       45    45  89       67         66
3   vikas       34    67  89       78         67
4      rk       67    89  67       67         45
5   dhruv       78    67  90       56         56

In [27]:
print(df[1]) #since dataframe contains rows and columns

#if you want to retrive the record of only one row then use   iloc() method

df.iloc[1]

name         amit
english        56
math           89
cs             56
physics        67
chemistry      87
Name: 1, dtype: object

In [4]:
print(df[1:5:2])

    name  english  math  cs  physics  chemistry
1   amit       56    89  56       67         87
3  vikas       34    67  89       78         67

In [5]:
print(df['name'])

0    rakesh
1      amit
2        jm
3     vikas
4        rk
5     dhruv
Name: name, dtype: object

In [9]:
print(df[['name','english']])  # only list of column name is allowed

     name  english
0  rakesh       45
1    amit       56
2      jm       45
3   vikas       34
4      rk       67
5   dhruv       78

In [30]:
df.iloc[1:4,[1,3,5]]   # iloc() is used to fetch rows or columns using their index values
                       # rows are defined in the form of slicing but columns are defined in the form 
                       # list of index numbers

   english  cs  chemistry
1       56  56         87
2       45  89         66
3       34  89         67

In [31]:
df

     name  english  math  cs  physics  chemistry
0  rakesh       45    87  56       56         78
1    amit       56    89  56       67         87
2      jm       45    45  89       67         66
3   vikas       34    67  89       78         67
4      rk       67    89  67       67         45
5   dhruv       78    67  90       56         56

changing DataFrame's Index

In [33]:
#changing dataFrame's index
df.set_index('name',inplace=True)
df

        english  math  cs  physics  chemistry
name
rakesh       45    87  56       56         78
amit         56    89  56       67         87
jm           45    45  89       67         66
vikas        34    67  89       78         67
rk           67    89  67       67         45
dhruv        78    67  90       56         56

Resetting original INdex

In [34]:
#reseting original index of the dataframe
df.reset_index(inplace=True)
df

     name  english  math  cs  physics  chemistry
0  rakesh       45    87  56       56         78
1    amit       56    89  56       67         87
2      jm       45    45  89       67         66
3   vikas       34    67  89       78         67
4      rk       67    89  67       67         45
5   dhruv       78    67  90       56         56

Change the name of any column

In [37]:
#changing all the column names of a DataFrame
df.columns=['Name','Eng','Maths','CompSc','Phy','Chem']
df

     Name  Eng  Maths  CompSc  Phy  Chem
0  rakesh   45     87      56   56    78
1    amit   56     89      56   67    87
2      jm   45     45      89   67    66
3   vikas   34     67      89   78    67
4      rk   67     89      67   67    45
5   dhruv   78     67      90   56    56

In [ ]:
# changing single column name 
df['name'] ='Student Name'